app/controllers/brands_controller.rb

  def show
    @brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @brand = Brand.new(brand_params)

    if(@brand.save)
---
INSERT INTO "brands" ("name", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "acer"], ["country", "China"], ["created_at", "2017-05-22 06:37:39.068853"], ["updated_at", "2017-05-22 06:37:39.068853"]]

  def edit
    @brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @brand = Brand.find(params[:id])

    if(@brand.update(brand_params))
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "brands" SET "name" = ?, "country" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["name", "Lenovo"], ["country", "China"], ["updated_at", "2017-05-22 12:35:56.094959"], ["id", 5]]