app/controllers/cpus_controller.rb

  def index
    @cpus = Cpu.all
---
SELECT "cpus".* FROM "cpus"

  def show
    @cpu = Cpu.find(params[:id])
---
SELECT  "cpus".* FROM "cpus" WHERE "cpus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @cpu = Cpu.new(cpu_params)

    if(@cpu.save)
---
INSERT INTO "cpus" ("cbrand", "cgen", "cfreq", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cbrand", "AMD"], ["cgen", "AMD E1-7010"], ["cfreq", "1.5"], ["created_at", "2017-05-22 13:21:41.367979"], ["updated_at", "2017-05-22 13:21:41.367979"]]

  def edit
    @cpu = Cpu.find(params[:id])
---
SELECT  "cpus".* FROM "cpus" WHERE "cpus"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @cpu = Cpu.find(params[:id])

    if(@cpu.update(cpu_params))
---
SELECT  "cpus".* FROM "cpus" WHERE "cpus"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cpus" SET "cgen" = ?, "cfreq" = ?, "updated_at" = ? WHERE "cpus"."id" = ?  [["cgen", "AMD E2-7110"], ["cfreq", "1.8"], ["updated_at", "2017-05-22 13:24:19.925048"], ["id", 2]]