app/controllers/disks_controller.rb

SELECT "disks".* FROM "disks"
---
  def index
    @disks = Disk.all

SELECT  "disks".* FROM "disks" WHERE "disks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @disk = Disk.find(params[:id])

INSERT INTO "disks" ("dhdd", "dssd", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["dhdd", "500"], ["dssd", "0"], ["created_at", "2017-05-22 14:25:56.895503"], ["updated_at", "2017-05-22 14:25:56.895503"]]
---
  def create
    @disk = Disk.new(disk_params)

    if(@disk.save)

SELECT  "disks".* FROM "disks" WHERE "disks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @disk = Disk.find(params[:id])

SELECT  "disks".* FROM "disks" WHERE "disks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "disks" SET "dssd" = ?, "updated_at" = ? WHERE "disks"."id" = ?  [["dssd", "0"], ["updated_at", "2017-05-22 14:26:52.715696"], ["id", 2]]
---
  def update
    @disk = Disk.find(params[:id])

    if(@disk.update(disk_params))