app/controllers/displays_controller.rb

  def index
    @displays = Display.all
---
SELECT "displays".* FROM "displays"

  def show
    @display = Display.find(params[:id])
---
SELECT  "displays".* FROM "displays" WHERE "displays"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @display = Display.new(displaying_params)

    if(@display.save)
---
INSERT INTO "displays" ("size", "dtype", "dtouch", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["size", "13.3 inch"], ["dtype", "Glare"], ["dtouch", "no"], ["created_at", "2017-05-22 08:38:26.029356"], ["updated_at", "2017-05-22 08:38:26.029356"]]

  def edit
    @display = Display.find(params[:id])
---
SELECT  "displays".* FROM "displays" WHERE "displays"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @display = Display.find(params[:id])

    if(@display.update(displaying_params))
---
SELECT  "displays".* FROM "displays" WHERE "displays"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "displays" SET "dtouch" = ?, "updated_at" = ? WHERE "displays"."id" = ?  [["dtouch", "yessss"], ["updated_at", "2017-05-22 12:52:51.576041"], ["id", 3]]