app/controllers/gpus_controller.rb

  def index
    @gpus = Gpu.all
---
SELECT "gpus".* FROM "gpus"

  def show
    @gpu = Gpu.find(params[:id])
---
SELECT  "gpus".* FROM "gpus" WHERE "gpus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @gpu = Gpu.new(gpu_params)

    if(@gpu.save)
---
INSERT INTO "gpus" ("cgen", "cbrand", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cgen", "Radeon R5 M330"], ["cbrand", "AMD"], ["created_at", "2017-05-22 14:00:00.099459"], ["updated_at", "2017-05-22 14:00:00.099459"]]

  def edit
    @gpu = Gpu.find(params[:id])
---
SELECT  "gpus".* FROM "gpus" WHERE "gpus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @gpu = Gpu.find(params[:id])

    if(@gpu.update(gpu_params))
---
SELECT  "gpus".* FROM "gpus" WHERE "gpus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "gpus" SET "cram" = ?, "updated_at" = ? WHERE "gpus"."id" = ?  [["cram", "2GB GDDR3"], ["updated_at", "2017-05-22 14:02:53.760392"], ["id", 1]]