app/controllers/keyboards_controller.rb

SELECT "keyboards".* FROM "keyboards"
---
  def index
    @keyboards = Keyboard.all

SELECT  "keyboards".* FROM "keyboards" WHERE "keyboards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @keyboard = Keyboard.find(params[:id])

INSERT INTO "keyboards" ("backl", "nump", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["backl", "no"], ["nump", "no"], ["created_at", "2017-05-22 15:03:44.267189"], ["updated_at", "2017-05-22 15:03:44.267189"]]
---
  def create
    @keyboard = Keyboard.new(keyboard_params)

    if(@keyboard.save)

SELECT  "keyboards".* FROM "keyboards" WHERE "keyboards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @keyboard = Keyboard.find(params[:id])

SELECT  "keyboards".* FROM "keyboards" WHERE "keyboards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "keyboards" SET "nump" = ?, "updated_at" = ? WHERE "keyboards"."id" = ?  [["nump", "yes"], ["updated_at", "2017-05-22 15:04:39.454346"], ["id", 2]]
---
  def update
    @keyboard = Keyboard.find(params[:id])

    if(@keyboard.update(keyboard_params))