app/controllers/laptops_controller.rb

SELECT  "laptops".* FROM "laptops" WHERE "laptops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @laptop = Laptop.find(params[:id])

INSERT INTO "laptops" ("lmodel", "created_at", "updated_at") VALUES (?, ?, ?)  [["lmodel", "K456UQ"], ["created_at", "2017-05-23 14:23:36.732696"], ["updated_at", "2017-05-23 14:23:36.732696"]]
---
  def create
    @laptop = Laptop.new(laptop_params)

    if(@laptop.save)