app/controllers/osystems_controller.rb

  def index
    @osystems = Osystem.all
---
SELECT "osystems".* FROM "osystems"

  def show
    @osystem = Osystem.find(params[:id])
---
SELECT  "osystems".* FROM "osystems" WHERE "osystems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @osystem = Osystem.new(osystem_params)

    if(@osystem.save)
---
INSERT INTO "osystems" ("ostype", "osver", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ostype", "DOS"], ["osver", "-"], ["created_at", "2017-05-22 16:04:41.128394"], ["updated_at", "2017-05-22 16:04:41.128394"]]

  def edit
    @osystem = Osystem.find(params[:id])
---
SELECT  "osystems".* FROM "osystems" WHERE "osystems"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @osystem = Osystem.find(params[:id])

    if(@osystem.update(osystem_params))
---
SELECT  "osystems".* FROM "osystems" WHERE "osystems"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "osystems" SET "osver" = ?, "updated_at" = ? WHERE "osystems"."id" = ?  [["osver", "Windows 10"], ["updated_at", "2017-05-22 16:05:37.471492"], ["id", 2]]