app/controllers/sells_controller.rb

  def show
    @sell = Sell.find(params[:id])
---
SELECT  "sells".* FROM "sells" WHERE "sells"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @sell = Sell.new(sell_params)

    if(@sell.save)
---
INSERT INTO "sells" ("price", "model", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["price", "18900"], ["model", "K456UQ"], ["created_at", "2017-05-23 16:32:40.152523"], ["updated_at", "2017-05-23 16:32:40.152523"]]