app/controllers/stores_controller.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @store = Store.find(params[:id])

INSERT INTO "stores" ("sname", "created_at", "updated_at") VALUES (?, ?, ?)  [["sname", "Advicesu"], ["created_at", "2017-05-23 10:30:59.143397"], ["updated_at", "2017-05-23 10:30:59.143397"]]
---
  def create
    @store = Store.new(store_params)

    if(@store.save)

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @store = Store.find(params[:id])

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stores" SET "sname" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["sname", "Advice"], ["updated_at", "2017-05-23 10:31:13.182050"], ["id", 1]]
---
  def update
    @store = Store.find(params[:id])

    if(@store.update(store_params))